; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-5-5-2-10-10-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear crate2)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 distributor0)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear crate1)
	(at pallet7 distributor2)
	(clear pallet7)
	(at pallet8 distributor3)
	(clear pallet8)
	(at pallet9 distributor4)
	(clear crate0)
	(at truck0 distributor1)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 distributor0)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor3)
	(available hoist8)
	(at hoist9 distributor4)
	(available hoist9)
	(at crate0 distributor4)
	(on crate0 pallet9)
	(at crate1 distributor1)
	(on crate1 pallet6)
	(at crate2 depot3)
	(on crate2 pallet3)
)

(:goal (and
		(on crate0 pallet7)
		(on crate1 pallet2)
		(on crate2 pallet8)
	)
))

; plan
1. (lift hoist6 crate1 pallet6 distributor1)
   deleted: (at crate1 distributor1) (available hoist6) (on crate1 pallet6) (clear crate1)
   added: (lifting hoist6 crate1) (clear pallet6)
   goals met: 0 of 3
2. (load hoist6 crate1 truck0 distributor1)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 0 of 3
3. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 0 of 3
4. (unload hoist2 crate1 truck0 depot2)
   deleted: (available hoist2) (in crate1 truck0)
   added: (lifting hoist2 crate1)
   goals met: 0 of 3
5. (lift hoist9 crate0 pallet9 distributor4)
   deleted: (at crate0 distributor4) (available hoist9) (on crate0 pallet9) (clear crate0)
   added: (lifting hoist9 crate0) (clear pallet9)
   goals met: 0 of 3
6. (drive truck1 distributor0 distributor4)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor4)
   goals met: 0 of 3
7. (load hoist9 crate0 truck1 distributor4)
   deleted: (lifting hoist9 crate0)
   added: (in crate0 truck1) (available hoist9)
   goals met: 0 of 3
8. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   goals met: 1 of 3
9. (drive truck1 distributor4 distributor2)
   deleted: (at truck1 distributor4)
   added: (at truck1 distributor2)
   goals met: 1 of 3
10. (drive truck0 depot2 depot3)
   deleted: (at truck0 depot2)
   added: (at truck0 depot3)
   goals met: 1 of 3
11. (lift hoist3 crate2 pallet3 depot3)
   deleted: (at crate2 depot3) (available hoist3) (on crate2 pallet3) (clear crate2)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 1 of 3
12. (load hoist3 crate2 truck0 depot3)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   goals met: 1 of 3
13. (drive truck0 depot3 distributor3)
   deleted: (at truck0 depot3)
   added: (at truck0 distributor3)
   goals met: 1 of 3
14. (unload hoist7 crate0 truck1 distributor2)
   deleted: (available hoist7) (in crate0 truck1)
   added: (lifting hoist7 crate0)
   goals met: 1 of 3
15. (drop hoist7 crate0 pallet7 distributor2)
   deleted: (lifting hoist7 crate0) (clear pallet7)
   added: (at crate0 distributor2) (available hoist7) (on crate0 pallet7) (clear crate0)
   goals met: 2 of 3
16. (unload hoist8 crate2 truck0 distributor3)
   deleted: (available hoist8) (in crate2 truck0)
   added: (lifting hoist8 crate2)
   goals met: 2 of 3
17. (drop hoist8 crate2 pallet8 distributor3)
   deleted: (lifting hoist8 crate2) (clear pallet8)
   added: (at crate2 distributor3) (available hoist8) (on crate2 pallet8) (clear crate2)
   goals met: 3 of 3
